
	<?php

use function Termwind\style;

	echo '<hr><hr><br><h2>Модуль №24.24-27:  Регистрация и авторизация пользователей</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #24.1-2 - Установка Laravel Breeze, Регистрация пользователей (День 24)</h3><hr><hr>' . "<br>";
		//!Урок 1: Установка Laravel Breeze
		/*
			В ходе урока установим библиотку "Breeze". Она нужна для авторизации/регистрации пользователй. Это более безопасный вариант, когда авторизация пишется с нуля.
			Это сложная задача, кльлоая в бОльшей части решает данная библиотека.
			Команда подключения библиотеки:
				composer require laravel/breeze
			Команда запуска библиотеки:
				php artisan breeze:instal
		*/

		//!Урок 2: Регистрация пользователей
		/*
			
		*/

	echo '<hr><hr><br><h3>Laravel - #25.1-2 - Подтверждение e-mail, Авторизация пользователей (День 25)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подтверждение e-mail
		/*
			
		*/

		//!Урок 2: Авторизация пользователей
		/*
			
		*/

	echo '<hr><hr><br><h3>Laravel - #26.1-3 - Подтверждение пароля, Выход из системы, Восстановление пароля (День 26)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подтверждение пароля
		/*
			
		*/

		//!Урок 2: Выход из системы
		/*
			
		*/

		//!Урок 3: Восстановление пароля
		/*
			
		*/

	echo '<hr><hr><br><h3>Laravel - #27.1-1 - Политики и права доступа (День 27)</h3><hr><hr>' . "<br>";
		//!Урок 1: Политики и права доступа
		/*
			
		*/

		