<?php
	echo '<hr><hr><br><h2>Модуль №1.1-4:  Введение (День 1)</h2>' . "<br>";
		//!Урок 1: Как проходить курс?
		//!Урок 2: Особенности Laravel
		//!Урок 3: Установка необходимого ПО
		//!Урок 4: Установка Laravel
	echo '<hr><hr><br><h2>Модуль №2.2-10:  Основы Laravel</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #2.1-2 - Структура директорий, Конфигурирование (День 2)</h3><hr><hr>' . "<br>";
		//!Урок 1: Структура директорий
		//!Урок 2: Конфигурирование
	echo '<hr><hr><br><h3>Laravel - #3.1-2 - Знакомство с Artisan и режим обслуживания, Маршрутизация (День 3)</h3><hr><hr>' . "<br>";
		//!Урок 1:  Знакомство с Artisan и режим обслуживания
		//!Урок 2: Маршрутизация
	echo '<hr><hr><br><h3>Laravel - #4.1-3 - Ограничение частоты запросов, Посредники, Контроллеры (День 4)</h3><hr><hr>' . "<br>";
		//!Урок 1:  Ограничение частоты запросов
		//!Урок 2: Посредники
		//!Задание №2.3 не пройдено:
		//!Урок 3: Контроллеры
	echo '<hr><hr><br><h3>Laravel - #5.1-2 - Шаблоны, Компоновщики шаблонов (День 5)</h3><hr><hr>' . "<br>";
		//!Урок 1: Шаблоны
		//!Урок 2: Компоновщики шаблоно
	echo '<hr><hr><br><h3>Laravel - #6.1 - Шаблоны Blade (День 6)</h3><hr><hr>' . "<br>";
		//!Урок 1: Шаблоны Blade
	echo '<hr><hr><br><h3>Laravel - #7.1-3 - Наследование шаблонов, Создание собственных директив, Компоненты (День 7)</h3><hr><hr>' . "<br>";
		//!Урок 1: Наследование шаблонов
		//!Задание №7.2 не пройдено:
		//!Урок 2: Создание собственных директив
		//!Урок 3: Компоненты
	echo '<hr><hr><br><h3>Laravel - #8.1-4 - Слоты, Макеты, Объект Request, Объект Response (День 8)</h3><hr><hr>' . "<br>";
		//!Урок 1: Слоты
		//!Урок 2: Макеты
		//!Урок 3: Объект Request
		//!Урок 4: Объект Response
	echo '<hr><hr><br><h3>Laravel - #9.1-3 - Работа с URL, Сессии, Обработка исключений (День 9)</h3><hr><hr>' . "<br>";
		//!Урок 1: Работа с URL
		//!Урок 2: Сессии
		//!Урок 3: Обработка исключений
	echo '<hr><hr><br><h3>Laravel - #10.1-2 - Пользовательские страницы ошибок, Логирование (День 10)</h3><hr><hr>' . "<br>";
		//!Урок 1: Пользовательские страницы ошибок
		//!Урок 2: Логирование
		echo '<hr><hr><br><h2>Модуль №11.11-14:  Работа с базой данных</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #11.1-2 - Подготовительный этап, Миграции (День 11)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подготовительный этап
		//!Урок 2: Миграции
	echo '<hr><hr><br><h3>Laravel - #12.1-2 - Использование Seeder, Отправка запросов через фасад DB (День 12)</h3><hr><hr>' . "<br>";
		//!Урок 1:  Использование Seeder
		//!Урок 2:  Отправка запросов через фасад DB
	echo '<hr><hr><br><h3>Laravel - #13.1-1 - Построение запросов (День 13)</h3><hr><hr>' . "<br>";
		//!Урок 1: Построение запросов
	echo '<hr><hr><br><h3>Laravel - #14.1-1 - Навигация по страницам (День 14)</h3><hr><hr>' . "<br>";
		//!Урок 1: Навигация по страницам
	echo '<hr><hr><br><h2>Модуль №15.15-19:  Модель</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #15.1-2 - Создание модели, Фабрика (День 15)</h3><hr><hr>' . "<br>";
		//!Урок 1: Создание модели
		//!Урок 2: Фабрика
	echo '<hr><hr><br><h3>Laravel - #16.1-1 - Работа с моделями (День 16)</h3><hr><hr>' . "<br>";
		//!Урок 1: Работа с моделями
	echo '<hr><hr><br><h3>Laravel - #17.1-2 - Аксессоры и мутаторы, Наблюдатели/Observers (День 17)</h3><hr><hr>' . "<br>";
		//!Урок 1: Аксессоры и мутаторы
		//!Урок 2: Наблюдатели/Observers
	echo '<hr><hr><br><h3>Laravel - #18.1-2 - Отношение один к одному, Отношение один ко многим (День 18)</h3><hr><hr>' . "<br>";
		//!Урок 1: Отношение один к одному
		//!Урок 2: Отношение один ко многим
	echo '<hr><hr><br><h3>Laravel - #19.1-2 - Отношение многие ко многим, Ресурсный контроллер (День 19)</h3><hr><hr>' . "<br>";
		//!Урок 1: Отношение многие ко многим
		//!Урок 2: Ресурсный контроллер 
	echo '<hr><hr><br><h2>Модуль №20.20-23:  Обработка форм</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #20.1-2 - Вывод форм, Валидация (День 20)</h3><hr><hr>' . "<br>";
		//!Урок 1: Вывод форм
		//!Урок 2: Валидация
	echo '<hr><hr><br><h3>Laravel - #21.1-2 - Класс запроса формы, Создание собственного правила валидации (День 21)</h3><hr><hr>' . "<br>";
		//!Урок 1: Класс запроса формы
		//!Урок 2: Создание собственного правила валидации
	echo '<hr><hr><br><h3>Laravel - #22.1-1 - Взаимодействие с моделями через формы (День 22)</h3><hr><hr>' . "<br>";
		//!Урок 1: Взаимодействие с моделями через формы
	echo '<hr><hr><br><h3>Laravel - #23.1-1 - Взаимодействие с файлами и их загрузка (День 23)</h3><hr><hr>' . "<br>";
		//!Урок 1: Взаимодействие с файлами и их загрузка
	echo '<hr><hr><br><h2>Модуль №24.24-27:  Регистрация и авторизация пользователей</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #24.1-2 - Установка Laravel Breeze, Регистрация пользователей (День 24)</h3><hr><hr>' . "<br>";
		//!Урок 1: Установка Laravel Breeze
		//!Урок 2: Регистрация пользователей
	echo '<hr><hr><br><h3>Laravel - #25.1-2 - Подтверждение e-mail, Авторизация пользователей (День 25)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подтверждение e-mail
		//!Урок 2: Авторизация пользователей
	echo '<hr><hr><br><h3>Laravel - #26.1-3 - Подтверждение пароля, Выход из системы, Восстановление пароля (День 26)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подтверждение пароля
		//!Урок 2: Выход из системы
		//!Урок 3: Восстановление пароля
	echo '<hr><hr><br><h3>Laravel - #27.1-1 - Политики и права доступа (День 27)</h3><hr><hr>' . "<br>";
		//!Урок 1: Политики и права доступа
	echo '<hr><hr><br><h2>Модуль №28.28-31: Дополнительные возможности</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #28.1 - Отправка e-mail (День 28)</h3><hr><hr>' . "<br>";
		//!Урок 1: Отправка e-mail
	echo '<hr><hr><br><h3>Laravel - #29.1-2 - Отправка уведомлений, События (День 29)</h3><hr><hr>' . "<br>";
		//!Урок 1: Отправка уведомлений
		//!Урок 2: События
	echo '<hr><hr><br><h3>Laravel - #30.1-2 - Создание собственных команд для Artisan, Планировщик задач (День 30)</h3><hr><hr>' . "<br>";
		//!Урок 1: Создание собственных команд для Artisan
		//!Урок 2: Планировщик задач
	echo '<hr><hr><br><h3>Laravel - #31.1-3 - Локализация, Helpers, Заключение (День 31)</h3><hr><hr>' . "<br>";
		//!Урок 1: Локализация
		//!Урок 2: Helpers
		//!Урок 3: Заключение
	echo '<hr><hr><br><h2>Модуль №32.32-40: Бонус "Создание сайта на Laravel"</h2>' . "<br>";
	echo '<hr><hr><br><h3>Laravel - #32.1-3 - Постановка задачи, Создание и настройка проекта, Создание моделей (День 32)</h3><hr><hr>' . "<br>";
		//!Урок 1: Постановка задачи
		//!Урок 2: Создание и настройка проекта
		//!Урок 3: Создание моделей
	echo '<hr><hr><br><h3>Laravel - #33.1 - Создание фабрик и наполнителей (День 33)</h3><hr><hr>' . "<br>";
		//!Урок 1: Создание фабрик и наполнителей
	echo '<hr><hr><br><h3>Laravel - #34.1 - Подготовка основного шаблона (День 34)</h3><hr><hr>' . "<br>";
		//!Урок 1: Подготовка основного шаблона
	echo '<hr><hr><br><h3>Laravel - #35.1-2 - Вывод главной страницы, Навигация по страницам (День 35)</h3><hr><hr>' . "<br>";
		//!Урок 1: Вывод главной страницы
		//!Урок 2: Навигация по страницам		
	echo '<hr><hr><br><h3>Laravel - #36.1-3 - Вывод страницы "Об авторе", Вывод страницы "Видеокурсы", Вывод страницы "Выпуски рассылки" (День 36)</h3><hr><hr>' . "<br>";
		//!Урок 1: Вывод страницы "Об авторе"		
		//!Урок 2: Вывод страницы "Видеокурсы"		
		//!Урок 3: Вывод страницы "Выпуски рассылки"		
	echo '<hr><hr><br><h3>Laravel - #37.1-3 - Вывод страницы "Сайты учеников", Добавление сайта, Добавление reCAPTCHA (День 37)</h3><hr><hr>' . "<br>";
		//!Урок 1: Вывод страницы "Сайты учеников"		
		//!Урок 2: Добавление сайта		
		//!Урок 3: Добавление reCAPTCHA		
	echo '<hr><hr><br><h3>Laravel - #38.1-2 - Вывод страницы с постом, Добавление комментариев (День 38)</h3><hr><hr>' . "<br>";
		//!Урок 1: Вывод страницы с постом		
		//!Урок 2: Добавление комментариев		
	echo '<hr><hr><br><h3>Laravel - #39.1-2 - Удаление комментариев, Добавление поиска (День 39)</h3><hr><hr>' . "<br>";
		//!Урок 1: Удаление комментариев	
		//!Урок 2: Добавление поиска		
	echo '<hr><hr><br><h3>Laravel - #40.1-3 - Создание ЧПУ-ссылок, Вывод страницы 404, Подведение итогов (День 40)</h3><hr><hr>' . "<br>";
		//!Урок 1: Создание ЧПУ-ссылок		
		//!Урок 2: Вывод страницы 404	
		//!Урок 3: Подведение итогов		

